/*
 * STM32H743ZG_peripherals.h
 *
 *  Created on: Sep 29, 2023
 *      Author: jbates
 */

#ifndef STM32H723ZG_PERIPHERALS_H_
#define STM32H723ZG_PERIPHERALS_H_

#include <stdint.h>

#define __vo volatile // For easy casting as volatile memory

/************** START: Processor specific details (cortex-m7) *****************/
/**
 * ARM Cortex M7 processor NVIC ISERx and ICERx register addresses
 */
#define NVIC_ISERX_BASEADDR 0xE000E100
#define NVIC_ICERX_BASEADDR 0xE000E180

typedef struct NVIC_RegDef {
  __vo uint32_t ISER[8]; // NVIC Interrupt set registers
  uint32_t RESERVED1[24];
  __vo uint32_t ICER[8]; // NVIC Interrupt clear registers
  uint32_t RESERVED2[24];
  __vo uint32_t ISPR[8]; // NVIC Interrupt set pending registers
  uint32_t RESERVED3[24];
  __vo uint32_t ICPR[8]; // NVIC Interrupt clear pending registers
  uint32_t RESERVED4[24];
  __vo uint32_t IABR[8]; // NVIC Interrupt active bit register (read only)
  uint32_t RESERVED5[56];
  __vo uint32_t IPR[60]; // NVIC Interrupt priority register
} NVIC_RegDef_t;

#define NVIC ((NVIC_RegDef_t *)NVIC_ISERX_BASEADDR)

/************** END: Processor specific details (cortex-m7) *****************/

// Base addresses of peripherals
#define HSEM_BASEADDR 0x58026400
#define ADC3_BASEADDR 0x58026000
#define DMAMUX2_BASEADDR 0x58025800
#define BDMA_BASEADDR 0x58025400
#define CRC_BASEADDR 0x58024C00
#define PWR_BASEADDR 0x58024800
#define RCC_BASEADDR 0x58024400

#define GPIOK_BASEADDR 0x58022800
#define GPIOJ_BASEADDR 0x58022400
#define GPIOH_BASEADDR 0x58021C00
#define GPIOG_BASEADDR 0x58021800
#define GPIOF_BASEADDR 0x58021400
#define GPIOE_BASEADDR 0x58021000
#define GPIOD_BASEADDR 0x58020C00
#define GPIOC_BASEADDR 0x58020800
#define GPIOB_BASEADDR 0x58020400
#define GPIOA_BASEADDR 0x58020000

#define DTS_BASEADDR 0x58006800
#define SAI4_BASEADDR 0x58005400
#define IWDG_BASEADDR 0x58004800
#define RTC_BASEADDR 0x58004000
#define VREF_BASEADDR 0x58003C00
#define COMP1_BASEADDR 0x58003800
#define LPTIM5_BASEADDR 0x58003000
#define LPTIM4_BASEADDR 0x58002C00
#define LPTIM3_BASEADDR 0x58002800
#define LPTIM2_BASEADDR 0x58002400
#define I2C4_BASEADDR 0x58001C00
#define SPI_I2S_6_BASEADDR 0x58001400
#define LPUART1_BASEADDR 0x58000C00
#define SYSCFG_BASEADDR 0x58000400
#define EXTI_BASEADDR 0x58000000

#define OTFDEC2_BASEADDR 0x5200BC00
#define OTFDEC1_BASEADDR 0x5200B800
#define OCTOSPI_IO_BASEADDR 0x5200B400
#define OCTOSPI2_DELAY_BASEADDR 0x5200B000
#define OCTOSPI2_BASEADDR 0x5200A000
#define RAMECC1_BASEADDR 0x52009000
#define SDMMC1_DELAY_BASEADDR 0x52008000
#define SDMMC1_BASEADDR 0x52007000
#define OCTOSPI1_DELAY_BASEADDR 0x52006000
#define OCTOSPI1_CTRL_BASEADDR 0x52005000
#define FMC_CTRL_BASEADDR 0x52004000
#define FLASH_INTERFACE_BASEADDR 0x52002000
#define DMA2D_CHROM_ART_BASEADDR 0x52001000
#define MDMA_BASEADDR 0x52000000
#define GPV_BASEADDR 0x51000000
#define WWDG_BASEADDR 0x50003000
#define LTDC_BASEADDR 0x50001000
#define CORDIC_BASEADDR 0x48024400
#define FMAC_BASEADDR 0x48024000
#define RAMECC_BASEADDR 0x48023000
#define SDMMC2_DELAY_BASEADDR 0x48022800
#define SDMMC2_BASEADDR 0x48022400
#define RNG_BASEADDR 0x48021800
#define HASH_BASEADDR 0x48021400
#define CRYPTO_BASEADDR 0x48021000
#define PSSI_BASEADDR 0x48020400
#define DCMI_BASEADDR 0x48020000

#define USB1_OTG_HS_BASEADDR 0x40040000
#define ETHERNET_MAC_BASEADDR 0x40028000
#define ADC1_ADC2_BASEADDR 0x40022000
#define DMAMUX1_BASEADDR 0x40020800
#define DMA2_BASEADDR 0x40020400
#define DMA1_BASEADDR 0x40020000
#define DFSDM1_BASEADDR 0x40017800
#define SAI1_BASEADDR 0x40015800
#define SPI5_BASEADDR 0x40015000
#define TIM17_BASEADDR 0x40014800
#define TIM16_BASEADDR 0x40014400
#define TIM15_BASEADDR 0x40014000
#define SPI4_BASEADDR 0x40013400
#define SPI1_I2S1_BASEADDR 0x40013000
#define USART10_BASEADDR 0x40011C00
#define UART9_BASEADDR 0x40011800
#define USART6_BASEADDR 0x40011400
#define USART1_BASEADDR 0x40011000
#define TIM8_BASEADDR 0x40010400
#define TIM1_BASEADDR 0x40010000

#define TIM24_BASEADDR 0x4000E400
#define TIM23_BASEADDR 0x4000E000
#define FDCAN3_BASEADDR 0x4000D400
#define CAN_BASEADDR 0x4000AC00
#define CAN_CCU_BASEADDR 0x4000A800
#define FDCAN2_BASEADDR 0x4000A400
#define FDCAN1_BASEADDR 0x4000A000
#define MDIOS_BASEADDR 0x40009400
#define OPAMP_BASEADDR 0x40009000
#define SWPMI_BASEADDR 0x40008800
#define CRS_BASEADDR 0x40008400
#define UART8_BASEADDR 0x40007C00
#define UART7_BASEADDR 0x40007800
#define DAC1_BASEADDR 0x40007400
#define HDMI_CEC_BASEADDR 0x40006C00
#define I2C5_BASEADDR 0x40006400
#define I2C3_BASEADDR 0x40005C00
#define I2C2_BASEADDR 0x40005800
#define I2C1_BASEADDR 0x40005400
#define UART5_BASEADDR 0x40005000
#define UART4_BASEADDR 0x40004C00
#define USART3_BASEADDR 0x40004800
#define USART2_BASEADDR 0x40004400
#define SPDIFRX1_BASEADDR 0x40004000
#define SPI3_I2S3_BASEADDR 0x40003C00
#define SPI2_I2S2_BASEADDR 0x40003800
#define LPTIM1_BASEADDR 0x40002400
#define TIM14_BASEADDR 0x40002000
#define TIM13_BASEADDR 0x40001C00
#define TIM12_BASEADDR 0x40001800

#define TIM7_BASEADDR 0x40001400
#define TIM6_BASEADDR 0x40001000
#define TIM5_BASEADDR 0x40000C00
#define TIM4_BASEADDR 0x40000800
#define TIM3_BASEADDR 0x40000400
#define TIM2_BASEADDR 0x40000000

// IRQ NVIC Position numbers
typedef enum {
  IRQ_NO_WWDG1 = 0,
  IRQ_NO_PVD_PVM,
  IRQ_NO_RTC_TAMP_STAMP_CSS__LSE,
  IRQ_NO_RTC_WKUP,
  IRQ_NO_FLASH,
  IRQ_NO_RCC,
  IRQ_NO_EXTIO,
  IRQ_NO_EXTI1,
  IRQ_NO_EXT12,
  IRQ_NO_EXT13,
  IRQ_NO_EXT14,
  IRQ_NO_DMA1_STRO,
  IRQ_NO_DMA1_STR1,
  IRQ_NO_DMA1_STR2,
  IRQ_NO_DMA1_STR3,
  IRQ_NO_DMA1_STR4,
  IRQ_NO_DMA1_STR5,
  IRQ_NO_DMA1_STR6,
  IRQ_NO_ADC1_2,
  IRQ_NO_FDCAN1_ITO,
  IRQ_NO_FDCAN2_ITO,
  IRQ_NO_FDCAN1_IT1,
  IRQ_NO_FDCAN2_IT1,
  IRQ_NO_EXTI9_5,
  IRQ_NO_TIM1_BRK,
  IRQ_NO_TIM1_UP,
  IRQ_NO_TIM1_TRG_COM,
  IRQ_NO_TIM1_CC,
  IRQ_NO_TIM2,
  IRQ_NO_TIM3,
  IRQ_NO_TIM4,
  IRQ_NO_I2C1_EV,
  IRQ_NO_I2C1_ER,
  IRQ_NO_I2C2_EV,
  IRQ_NO_I2C2_ER,
  IRQ_NO_SPI1,
  IRQ_NO_SPI2,
  IRQ_NO_USART1,
  IRQ_NO_USART2,
  IRQ_NO_USART3,
  IRQ_NO_EXTI15_10,
  IRQ_NO_RTC_ALARM,
  IRQ_NO_RESERVED1,
  IRQ_NO_TIM8_BRK__TIM12,
  IRQ_NO_TIM8_UP_TIM13,
  IRQ_NO_TIM8_TRG__COM_TIM14,
  IRQ_NO_TIM8_CC,
  IRQ_NO_DMA1_STR7,
  IRQ_NO_FMC,
  IRQ_NO_SDMMC1,
  IRQ_NO_TIM5,
  IRQ_NO_SPI3,
  IRQ_NO_UART4,
  IRQ_NO_UART5,
  IRQ_NO_TIM6_DAC,
  IRQ_NO_TIM7,
  IRQ_NO_DMA2_STRO,
  IRQ_NO_DMA2_STR1,
  IRQ_NO_DMA2_STR2,
  IRQ_NO_DMA2_STR3,
  IRQ_NO_DMA2_STR4,
  IRQ_NO_ETH,
  IRQ_NO_ETH_WKUP,
  IRQ_NO_FDCAN_CAL,
  IRQ_NO_RESERVED2,
  IRQ_NO_RESERVED3,
  IRQ_NO_RESERVED4,
  IRQ_NO_RESERVED5,
  IRQ_NO_DMA2_STR5,
  IRQ_NO_DMA2_STR6,
  IRQ_NO_DMA2_STR7,
  IRQ_NO_USART6,
  IRQ_NO_I2C3_EV,
  IRQ_NO_I2C3_ER,
  IRQ_NO_OTG_HS_EP1__OUT,
  IRQ_NO_OTG_HS_EP1__IN,
  IRQ_NO_OTG_HS_WKUP,
  IRQ_NO_OTG_HS,
  IRQ_NO_DCMI_PSSI,
  IRQ_NO_CRYP,
  IRQ_NO_HASH_RNG,
  IRQ_NO_FPU,
  IRQ_NO_UART7,
  IRQ_NO_UART8,
  IRQ_NO_SP14,
  IRQ_NO_SPI5,
  IRQ_NO_SPI6,
  IRQ_NO_SAI1,
  IRQ_NO_LTDC,
  IRQ_NO_LTDC_ERR,
  IRQ_NO_DMA2D,
  IRQ_NO_RESERVED6,
  IRQ_NO_OCTOSPI1,
  IRQ_NO_LPTIM1,
  IRQ_NO_CEC,
  IRQ_NO_I2C4_EV,
  IRQ_NO_I2C4_ER,
  IRQ_NO_SPDIF,
  IRQ_NO_RESERVED7,
  IRQ_NO_RESERVED8,
  IRQ_NO_RESERVED9,
  IRQ_NO_RESERVED10,
  IRQ_NO_DMAMUX1_OV,
  IRQ_NO_RESERVED11,
  IRQ_NO_RESERVED12,
  IRQ_NO_RESERVED13,
  IRQ_NO_RESERVED14,
  IRQ_NO_RESERVED15,
  IRQ_NO_RESERVED16,
  IRQ_NO_RESERVED17,
  IRQ_NO_DFSDM1_FLTO,
  IRQ_NO_DFSDM1_FLT1,
  IRQ_NO_DFSDM1_FLT2,
  IRQ_NO_DFSDM1_FLT3,
  IRQ_NO_RESERVED18,
  IRQ_NO_SWPMI1,
  IRQ_NO_TIM15,
  IRQ_NO_TIM16,
  IRQ_NO_TIM17,
  IRQ_NO_MDIOS_WKUP,
  IRQ_NO_MDIOS,
  IRQ_NO_RESERVED19,
  IRQ_NO_MDMA,
  IRQ_NO_RESERVED20,
  IRQ_NO_SDMMC2,
  IRQ_NO_HSEMO,
  IRQ_NO_RESERVED21,
  IRQ_NO_ADC3,
  IRQ_NO_DMAMUX2_OVR,
  IRQ_NO_BDMA_CHO,
  IRQ_NO_BDMA_CH1,
  IRQ_NO_BDMA_CH2,
  IRQ_NO_BDMA_CH3,
  IRQ_NO_BDMA_CH4,
  IRQ_NO_BDMA_CH5,
  IRQ_NO_BDMA_CH6,
  IRQ_NO_BDMA_CH7,
  IRQ_NO_COMP,
  IRQ_NO_LPTIM2,
  IRQ_NO_LPTIM3,
  IRQ_NO_LPTIM4,
  IRQ_NO_LPTIM5,
  IRQ_NO_LPUART,
  IRQ_NO_RESERVED22,
  IRQ_NO_CRS,
  IRQ_NO_ECC_DIAG_IT,
  IRQ_NO_SAI4,
  IRQ_NO_TEMP_IT,
  IRQ_NO_RESERVED23,
  IRQ_NO_WKUP,
  IRQ_NO_OCTOSPI2,
  IRQ_NO_OTFDEC1,
  IRQ_NO_OTFDEC2,
  IRQ_NO_FMAC,
  IRQ_NO_CORDIC_IT,
  IRQ_NO_UART9,
  IRQ_NO_USART10,
  IRQ_NO_I2C5_EV,
  IRQ_NO_I2C5_ER,
  IRQ_NO_FDCAN3_ITO,
  IRQ_NO_FDCAN3_IT1,
  IRQ_NO_TIM23,
  IRQ_NO_TIM24
} NVIC_INTERRUPT_POSITIONS;

// -------------peripheral structs-------------
// Use these with and declare them as pointer structs to
// be able to access the memory easily

typedef struct RCC_RegDef {
  __vo uint32_t CR; // 0
  __vo uint32_t HSICFGR;
  __vo uint32_t CRRCR;
  __vo uint32_t CSICFGR;
  __vo uint32_t CFGR; // 10
  uint32_t RESERVED1;
  __vo uint32_t D1CFGR; // good
  __vo uint32_t D2CFGR;
  __vo uint32_t D3CFGR; // 20
  uint32_t RESERVED2;
  __vo uint32_t PLLCKSELR;
  __vo uint32_t PLLCFGR;
  __vo uint32_t PLL1DIVR; // 30
  __vo uint32_t PLL1FRACR;
  __vo uint32_t PLL2DIVR;
  __vo uint32_t PLL2FRACR;
  __vo uint32_t PLL3DIVR; // 40
  __vo uint32_t PLL3FRACR;
  uint32_t RESERVED3;
  __vo uint32_t D1CCIPR;  // good
  __vo uint32_t D2CCIP1R; // 50
  __vo uint32_t D2CCIP2R;
  __vo uint32_t D3CCIPR;
  uint32_t RESERVED4;
  __vo uint32_t CIER; // 60
  __vo uint32_t CIFR;
  __vo uint32_t CICR;
  uint32_t RESERVED5;
  __vo uint32_t BDCR; // good //70
  __vo uint32_t CSR;
  uint32_t RESERVED6;
  __vo uint32_t AHB3RSTR;
  __vo uint32_t AHB1RSTR; // 80
  __vo uint32_t AHB2RSTR;
  __vo uint32_t AHB4RSTR;
  __vo uint32_t APB3RSTR;
  __vo uint32_t APB1LRSTR; // 90
  __vo uint32_t APB1HRSTR; // good
  __vo uint32_t APB2RSTR;
  __vo uint32_t APB4RSTR;
  __vo uint32_t GCR; // A0
  uint32_t RESERVED7;
  __vo uint32_t D3AMR;
  uint32_t RESERVED8[9];
  __vo uint32_t RSR; // D0
  __vo uint32_t AHB3ENR;
  __vo uint32_t AHB1ENR; // good
  __vo uint32_t AHB2ENR;
  __vo uint32_t AHB4ENR; // E0
  __vo uint32_t APB3ENR;
  __vo uint32_t APB1LENR;
  __vo uint32_t APB1HENR;
  __vo uint32_t APB2ENR; // F0
  __vo uint32_t APB4ENR;
  uint32_t RESERVED9;
  __vo uint32_t AHB3LPENR;
  __vo uint32_t AHB1LPENR; // good 00
  __vo uint32_t AHB2LPENR;
  __vo uint32_t AHB4LPENR;
  __vo uint32_t APB3LPENR;
  __vo uint32_t APB1LLPENR; // 10
  __vo uint32_t APB1HLPENR;
  __vo uint32_t APB2LPENR; // good
  __vo uint32_t APB4LPENR;
  uint32_t RESERVED10[4];
  __vo uint32_t C1_RSR; // 30
  __vo uint32_t C1_AHB3ENR;
  __vo uint32_t C1_AHB1ENR;
  __vo uint32_t C1_AHB2ENR;
  __vo uint32_t C1_AHB4ENR; // 40
  __vo uint32_t C1_APB3ENR; // good
  __vo uint32_t C1_APB1LENR;
  __vo uint32_t C1_APB1HENR;
  __vo uint32_t C1_APB2ENR; // 50
  __vo uint32_t C1_APB4ENR;
  uint32_t RESERVED11;
  __vo uint32_t C1_AHB3LPENR;
  __vo uint32_t C1_AHB1LPENR; // 60
  __vo uint32_t C1_AHB2LPENR;
  __vo uint32_t C1_AHB4LPENR;
  __vo uint32_t C1_APB3LPENR;
  __vo uint32_t C1_APB1LLPENR; // 70
  __vo uint32_t C1_APB1HLPENR;
  __vo uint32_t C1_APB2LPENR;
  __vo uint32_t C1_APB4LPENR;
} RCC_RegDef_t;

typedef struct HSEM_RegDef {
  __vo uint32_t HSEM_R[32];   // HSEM register semaphore
  __vo uint32_t HSEM_RLR[32]; // HSEM read lock register semaphore
  __vo uint32_t HSEM_IER;     // HSEM interrupt enable register
  __vo uint32_t HSEM_ICR;     // HSEM interrupt clear register
  __vo uint32_t HSEM_ISR;     // HSEM interrupt status register
  __vo uint32_t HSEM_MISR;    // HSEM master interrupt status register
  __vo uint32_t HSEM_CR;      // HSEM clear register
  __vo uint32_t HSEM_KEYR;    // HSEM interrupt clear register
} HSEM_RegDef_t;

typedef struct GPIO_RegDef {
  __vo uint32_t MODER;   // GPIO Mode register
  __vo uint32_t OTYPER;  // GPIO Output type register
  __vo uint32_t OSPEEDR; // GPIO Output speed register
  __vo uint32_t PUPDR;   // GPIO Pull-up/Pull-down register
  __vo uint32_t IDR;     // GPIO Input data register
